{
  "artists": [
    {
      "slug": "reid-miles",
      "name": "Reid Miles",
      "famous_for": "Blue Note Records (1950s–60s jazz covers)",
      "style": "Bold typography, minimalist layouts, stylish black-and-white photography.",
      "portrait": "reid-miles.jpg",
      "artwork": "reid-cover.jpg",
      "quotes": "\"It’s all about rhythm — not just in music, but in design.\""
    },
    {
      "slug": "storm-thorgerson",
      "name": "Storm Thorgerson (Hipgnosis)",
      "famous_for": "Pink Floyd (Dark Side of the Moon, Wish You Were Here), Led Zeppelin (Houses of the Holy)",
      "style": "Surreal, dreamlike, and thought-provoking photo-based designs. Helped redefine what an album cover could be — almost like album covers as fine art.",
      "portrait": "storm-thorgenson.jpeg",
      "artwork": "storm-cover.jpg",
      "quotes": "\"You don’t just design a cover; you create an atmosphere, a mystery.\""
    },
    {
      "slug": "pete-saville",
      "name": "Pete Saville",
      "famous_for": "Joy Division (Unknown Pleasures), New Order",
      "style": "Minimalist, experimental, used scientific and abstract imagery with cool muted palettes.",
      "portrait": "peter-savilee.jpg",
      "artwork": "peter-cover.jpeg",
      "quotes": "\"Design should be open to interpretation — like the music itself.\""
    },
    {
      "slug": "barney-bubbles",
      "name": "Barney Bubbles",
      "famous_for": "Elvis Costello, Ian Dury, Hawkwind",
      "style": "Playful, rebellious, mixed retro graphics with punk attitude — sometimes coded his work with hidden messages.",
      "portrait": "barney-bubbles.jpg",
      "artwork": "barney-cover.jpeg",
      "quotes": "\"If you can read it easily, you’re doing it wrong.\""
    },
    {
      "slug": "jean-paul-goude",
      "name": "Jean-Paul Goude",
      "famous_for": "Grace Jones album covers like Island Life",
      "style": "Visually stunning photography combined with surreal graphic manipulation. Totally sculpted Grace Jones' visual persona.",
      "portrait": "jean-paule-goude.jpeg",
      "artwork": "jean-cover.jpg",
      "quotes": "\"Photography isn’t just capturing reality — it’s inventing a new one.\""
    },
    {
      "slug": "art-kane",
      "name": "Art Kane",
      "famous_for": "Music photography for The Who, Cream, Bob Dylan, Frank Zappa",
      "style": "Bold color usage, narrative-driven photography that often felt cinematic and larger-than-life.",
      "portrait": "art-kane.jpg",
      "artwork": "art-cover.jpg",
      "quotes": "\"A great photograph is a performance frozen in time.\""
    }
  ]
}
